# DATA CLEANING & EDA FOR FINTECH CUSTOMER RETENTION

# importing the needed libaries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
%matplotlib inline

# importing the datasst

In [2]:
login = pd.read_csv(r"F:\DATASET\FINTECH CUSTOMER RETENTION\DATASET\login_activity.csv")
login

       user_id  login_date
0      U100622  2025-07-15
1      U100241  2025-07-02
2      U101767  2025-05-07
3      U100491  2025-06-09
4      U101275  2025-05-09
...        ...         ...
29995  U101429  2025-07-15
29996  U100473  2025-05-07
29997  U102427  2025-06-13
29998  U100673  2025-06-24
29999  U100666  2025-05-19

[30000 rows x 2 columns]

In [4]:
login.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     30000 non-null  object
 1   login_date  30000 non-null  object
dtypes: object(2)
memory usage: 468.9+ KB

In [5]:
login['login_date'] = pd.to_datetime(login['login_date'])

In [6]:
login.isnull().sum()

user_id       0
login_date    0
dtype: int64

In [7]:
login[login.duplicated(subset = 'user_id')]

       user_id login_date
36     U101005 2025-07-14
91     U102494 2025-07-18
130    U102008 2025-06-12
140    U100794 2025-05-21
172    U102792 2025-05-20
...        ...        ...
29995  U101429 2025-07-15
29996  U100473 2025-05-07
29997  U102427 2025-06-13
29998  U100673 2025-06-24
29999  U100666 2025-05-19

[27000 rows x 2 columns]

In [8]:
login[login.duplicated()]

       user_id login_date
405    U100071 2025-06-22
955    U100052 2025-07-13
1188   U101480 2025-05-21
1674   U102845 2025-06-13
1701   U100273 2025-05-10
...        ...        ...
29942  U101002 2025-07-05
29947  U102592 2025-05-14
29955  U101607 2025-05-20
29956  U101189 2025-07-09
29964  U102735 2025-05-27

[1632 rows x 2 columns]

In [10]:
login

       user_id login_date
0      U100622 2025-07-15
1      U100241 2025-07-02
2      U101767 2025-05-07
3      U100491 2025-06-09
4      U101275 2025-05-09
...        ...        ...
29995  U101429 2025-07-15
29996  U100473 2025-05-07
29997  U102427 2025-06-13
29998  U100673 2025-06-24
29999  U100666 2025-05-19

[28368 rows x 2 columns]

In [60]:
login.info()

<class 'pandas.core.frame.DataFrame'>
Index: 28368 entries, 0 to 29999
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     28368 non-null  object
 1   login_date  28368 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 664.9+ KB

In [61]:
login.head()

   user_id login_date
0  U100622 2025-07-15
1  U100241 2025-07-02
2  U101767 2025-05-07
3  U100491 2025-06-09
4  U101275 2025-05-09

In [62]:
gold_login_activities = login

In [63]:
gold_login_activities.head(2)

   user_id login_date
0  U100622 2025-07-15
1  U100241 2025-07-02

# saving this cleaned dataset to the file path(gold_login_activities)

In [64]:
gold_login_activities.to_csv(r"F:\DATASET\FINTECH CUSTOMER RETENTION\DATASET\gold_login_activities.csv", index=False)

# importing transactions dataset (transactions_logs)

In [11]:
trans = pd.read_csv(r"F:\DATASET\FINTECH CUSTOMER RETENTION\DATASET\transaction_logs.csv")

In [12]:
trans

       user_id    txn_date  txn_amount channel txn_type   txn_id
0      U100323  2025-06-04      177.91    USSD     bill  T000001
1      U100090  2025-06-13      535.95     App     bill  T000002
2      U102532  2025-05-14      917.15    USSD     send  T000003
3      U101399  2025-05-23      186.18    USSD    topup  T000004
4      U101323  2025-05-14      786.74    USSD     loan  T000005
...        ...         ...         ...     ...      ...      ...
29995  U102567  2025-06-28      575.82     App     bill  T029996
29996  U102267  2025-07-12      294.23     App     send  T029997
29997  U101782  2025-07-25      432.58     App    topup  T029998
29998  U100869  2025-07-12      125.99    USSD     loan  T029999
29999  U102276  2025-06-22      853.70    USSD    topup  T030000

[30000 rows x 6 columns]

In [13]:
   trans.dtypes

user_id        object
txn_date       object
txn_amount    float64
channel        object
txn_type       object
txn_id         object
dtype: object

In [14]:
trans[trans.duplicated()]

Empty DataFrame
Columns: [user_id, txn_date, txn_amount, channel, txn_type, txn_id]
Index: []

In [15]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     30000 non-null  object
 1   txn_date    30000 non-null  object
 2   txn_amount  30000 non-null  float64
 3   channel     30000 non-null  object
 4   txn_type    30000 non-null  object
 5   txn_id      30000 non-null  object
dtypes: float64(1), object(5)
memory usage: 1.4+ MB

In [16]:
trans.describe()

         txn_amount
count  30000.000000
mean     497.877207
std      288.135365
min        1.050000
25%      249.005000
50%      495.170000
75%      746.352500
max     1000.000000

In [17]:
trans.columns

Index(['user_id', 'txn_date', 'txn_amount', 'channel', 'txn_type', 'txn_id'], dtype='object')

In [18]:
trans['txn_type'].unique()

array(['bill', 'send', 'topup', 'loan'], dtype=object)

In [19]:
trans['txn_type'] = trans['txn_type'].replace({'send': 'funds'})

In [20]:
trans['txn_type'].unique()

array(['bill', 'funds', 'topup', 'loan'], dtype=object)

In [21]:
trans.groupby('txn_type')['txn_amount'].mean().sort_values(ascending = False)

txn_type
topup    499.480456
loan     498.431867
bill     497.311129
funds    496.278432
Name: txn_amount, dtype: float64

In [22]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     30000 non-null  object
 1   txn_date    30000 non-null  object
 2   txn_amount  30000 non-null  float64
 3   channel     30000 non-null  object
 4   txn_type    30000 non-null  object
 5   txn_id      30000 non-null  object
dtypes: float64(1), object(5)
memory usage: 1.4+ MB

In [23]:
trans['txn_date'] = pd.to_datetime(trans['txn_date'])

In [49]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     30000 non-null  object
 1   txn_date    30000 non-null  datetime64[ns]
 2   txn_amount  30000 non-null  float64
 3   channel     30000 non-null  object
 4   txn_type    30000 non-null  object
 5   txn_id      30000 non-null  object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 1.4+ MB

In [51]:
trans['txn_type'].unique()

array(['bill', 'funds', 'topup', 'loan'], dtype=object)

In [55]:
gold_transactions_logs = trans

In [56]:
gold_transactions_logs.head()

   user_id   txn_date  txn_amount channel txn_type   txn_id
0  U100323 2025-06-04      177.91    USSD     bill  T000001
1  U100090 2025-06-13      535.95     App     bill  T000002
2  U102532 2025-05-14      917.15    USSD    funds  T000003
3  U101399 2025-05-23      186.18    USSD    topup  T000004
4  U101323 2025-05-14      786.74    USSD     loan  T000005

# Saving the datset to the file path in csv (transactions_logs)

In [65]:
gold_transactions_logs.to_csv(r"F:\DATASET\FINTECH CUSTOMER RETENTION\DATASET\gold_transactions_logs.csv", index=False)

# importing user dataset(user_master)

In [24]:
user = pd.read_csv(r"F:\DATASET\FINTECH CUSTOMER RETENTION\DATASET\user_master.csv")

In [25]:
user

      user_id signup_date  gender  age         region
0     U100000  2024-10-23  Female   59  Greater Accra
1     U100001  2024-10-20  Female   51          Volta
2     U100002  2025-06-26  Female   47          Volta
3     U100003  2024-11-28  Female   30        Ashanti
4     U100004  2024-08-06    Male   30        Ashanti
...       ...         ...     ...  ...            ...
2995  U102995  2025-05-07  Female   59          Volta
2996  U102996  2025-03-29    Male   29  Greater Accra
2997  U102997  2024-08-21    Male   59  Greater Accra
2998  U102998  2025-02-16  Female   30        Eastern
2999  U102999  2024-10-14    Male   28        Western

[3000 rows x 5 columns]

In [26]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_id      3000 non-null   object
 1   signup_date  3000 non-null   object
 2   gender       3000 non-null   object
 3   age          3000 non-null   int64
 4   region       3000 non-null   object
dtypes: int64(1), object(4)
memory usage: 117.3+ KB

In [27]:
user.describe()

               age
count  3000.000000
mean     38.581667
std      12.081445
min      18.000000
25%      28.000000
50%      39.000000
75%      49.000000
max      59.000000

In [28]:
user.columns

Index(['user_id', 'signup_date', 'gender', 'age', 'region'], dtype='object')

In [29]:
user.gender.unique()

array(['Female', 'Male'], dtype=object)

In [30]:
user.region.unique()

array(['Greater Accra', 'Volta', 'Ashanti', 'Western', 'Eastern'],
      dtype=object)

In [31]:
user.region = user.region.replace({'Greater Accra': 'Greater_Accra'})

In [32]:
user['signup_date'] = pd.to_datetime(user['signup_date'])

In [33]:
user.head(5)

   user_id signup_date  gender  age         region
0  U100000  2024-10-23  Female   59  Greater_Accra
1  U100001  2024-10-20  Female   51          Volta
2  U100002  2025-06-26  Female   47          Volta
3  U100003  2024-11-28  Female   30        Ashanti
4  U100004  2024-08-06    Male   30        Ashanti

In [34]:
user.groupby('region')['user_id'].count().sort_values(ascending = False)

region
Ashanti          669
Greater_Accra    605
Volta            587
Eastern          585
Western          554
Name: user_id, dtype: int64

In [35]:
user.groupby('gender')['user_id'].count().sort_values(ascending = False)

gender
Female    1506
Male      1494
Name: user_id, dtype: int64

In [36]:
user.groupby('user_id')['age'].mean().sort_values(ascending = False)

user_id
U100000    59.0
U100770    59.0
U101927    59.0
U100137    59.0
U100329    59.0
           ...
U100508    18.0
U102508    18.0
U100813    18.0
U100484    18.0
U102884    18.0
Name: age, Length: 3000, dtype: float64

In [37]:
user

      user_id signup_date  gender  age         region
0     U100000  2024-10-23  Female   59  Greater_Accra
1     U100001  2024-10-20  Female   51          Volta
2     U100002  2025-06-26  Female   47          Volta
3     U100003  2024-11-28  Female   30        Ashanti
4     U100004  2024-08-06    Male   30        Ashanti
...       ...         ...     ...  ...            ...
2995  U102995  2025-05-07  Female   59          Volta
2996  U102996  2025-03-29    Male   29  Greater_Accra
2997  U102997  2024-08-21    Male   59  Greater_Accra
2998  U102998  2025-02-16  Female   30        Eastern
2999  U102999  2024-10-14    Male   28        Western

[3000 rows x 5 columns]

In [44]:
gold_user_master = user

In [45]:
gold_user_master

      user_id signup_date  gender  age         region
0     U100000  2024-10-23  Female   59  Greater_Accra
1     U100001  2024-10-20  Female   51          Volta
2     U100002  2025-06-26  Female   47          Volta
3     U100003  2024-11-28  Female   30        Ashanti
4     U100004  2024-08-06    Male   30        Ashanti
...       ...         ...     ...  ...            ...
2995  U102995  2025-05-07  Female   59          Volta
2996  U102996  2025-03-29    Male   29  Greater_Accra
2997  U102997  2024-08-21    Male   59  Greater_Accra
2998  U102998  2025-02-16  Female   30        Eastern
2999  U102999  2024-10-14    Male   28        Western

[3000 rows x 5 columns]

# Saving the cleanned dataset to the filepath(gold_user_master)

In [47]:

gold_user_master.to_csv(r"F:\DATASET\FINTECH CUSTOMER RETENTION\DATASET\gold_user_master.csv", index=False)